console.log(`
      **ТЗ** 
https://github.com/rolling-scopes-school/tasks/blob/master/tasks/library/library-part2.md

            **Форма для проверки** 
https://rolling-scopes-school.github.io/checklist/


**Ваша оценка - 50 баллов** 

#### Отзыв по пунктам ТЗ:

#####**Выполненные пункты:**

1) Блок \`header\`

2) Секция Welcome

3) Cекция About. Обратите внимание на появление новых элементов в виде стрелок и переход на 5 точек вместо 3х.❗Не нужно менять расстояние от картинки до точек, нужно оставить 40px. Оценку не снижаем, если сделано по макету (25px).

Отзыв: расстояние от картинки до точек, оставлено 40px Дальнейшая вёрстка из - за этого при проверке отличается от старого макета на 15px (исправляется путём ввода в окне 'Y' Pixel Perfect menu 15 (=== 15px))

4) Секция Favorites

5) ❗Сделать кнопку own, вместо buy для последней книги. Здесь важно будет соблюсти условие, что, какие кнопки находились в состояние own на Desktop, те же кнопки в том же состоянии будут и на Tablet.

6) Секция CoffeeShop

7) Секция Contacts

8) Секция LibraryCard

9) Блок \`footer\`

10) Нет полосы прокрутки при ширине страницы от 1440рх до 640рх

11) Элементы не выходят за пределы окна браузера при ширине страницы от 1440рх до 640рх

12) Элементы не наезжают друг на друга при ширине страницы от 1440рх до 640рх

13) Иконка юзера не прыгает (не меняет позиции при открытии меню), независимо от величины отступа

14) При нажатии на бургер-иконку плавно появляется адаптивное меню

15) При нажатии на крестик, или на область вне меню, адаптивное меню плавно скрывается, уезжая за экран

16) Ссылки в адаптивном меню работают, обеспечивая плавную прокрутку по якорям при нажатии, а само адаптивное меню при этом плавно скрывается

17) Размеры открытого бургер-меню соответствуют макету, так же открытое бургер-меню проверяется на PixelPerfect

`)